Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: يحلفون بالله ما قالوا ولقد قالوا كلمة الكفر وكفروا بعد إسلامهم وهموا بما لم ينالوا وما نقموا إلا أن أغناهم الله ورسوله من فضله فإن يتوبوا يك خيرا لهم وإن يتولوا يعذبهم الله عذابا أليما في الدنيا والآخرة وما لهم في الأرض من ولي ولا نصير
en: They swear by Allah that they said nothing (bad), but really they said the word of disbelief, and they disbelieved after accepting Islam, and they resolved that (plot to murder Prophet Muhammad صلى الله عليه وسلم) which they were unable to carry out, and they could not find any cause to do so except that Allah and His Messenger had enriched them of His Bounty. If then they repent, it will be better for them, but if they turn away, Allah will punish them with a painful torment in this worldly life and in the Hereafter. And there is none for them on earth as a Wali (supporter, protector) or a helper.

source: ومنهم من عاهد الله لئن آتانا من فضله لنصدقن ولنكونن من الصالحين
en: And of them are some who made a covenant with Allah (saying): "If He bestowed on us of His Bounty, we will verily give Sadaqah (Zakat and voluntary charity in Allah's Cause) and will be certainly among those who are righteous."

source: فلما آتاهم من فضله بخلوا به وتولوا وهم معرضون
en: Then when He gave them of His Bounty, they became niggardly [refused to pay the Sadaqah (Zakat or voluntary charity)], and turned away, averse.

source: فأعقبهم نفاقا في قلوبهم إلى يوم يلقونه بما أخلفوا الله ما وعدوه وبما كانوا يكذبون
en: So He punished them by putting hypocrisy into their hearts till the Day whereon they shall meet Him, because they broke that (covenant with Allah) which they had promised to Him and because they used to tell lies.

source: ألم يعلموا أن الله يعلم سرهم ونجواهم وأن الله علام الغيوب
en: Know they not that Allah knows their secret ideas, and their Najwa (secret counsels), and that Allah is the All-Knower of things unseen.

source: الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم فيسخرون منهم سخر الله منهم ولهم عذاب أليم
en: Those who defame such of the believers who give charity (in Allah's Cause) voluntarily, and such who could not find to give charity (in Allah's Cause) except what is available to them - so they mock at them (believers); Allah will throw back their mockery on them, and they shall have a painful torment.

source: استغفر لهم أو لا تستغفر لهم إن تستغفر لهم سبعين مرة فلن يغفر الله لهم ذلك بأنهم كفروا بالله ورسوله والله لا يهدي القوم الفاسقين
en: Whether you (O Muhammad صلى الله عليه وسلم) ask forgiveness for them (hypocrites) or ask not forgiveness for them - (and even) if you ask seventy times for their forgiveness - Allah will not forgive them because they have disbelieved in Allah and His Messenger (Muhammad صلى الله عليه وسلم). And Allah guides not those people who are Fasiqun (rebellious, disobedient to Allah).

source: فرح المخلفون بمقعدهم خلاف رسول الله وكرهوا أن يجاهدوا بأموالهم وأنفسهم في سبيل الله وقالوا لا تنفروا في الحر قل نار جهنم أشد حرا لو كانوا يفقهون
en: Those who stayed away (from Tabuk expedition) rejoiced in their staying behind the Messenger of Allah; they hated to strive and fight with their properties and their lives in the Cause of Allah, and they said: "March not forth in the heat." Say: "The Fire of Hell is more intense in heat"; if only they could understand!

source: فليضحكوا قليلا وليبكوا كثيرا جزاء بما كانوا يكسبون
en: So let them laugh a little and (they will) cry much as a recompense of what they used to earn (by committing sins).

source: فإن رجعك الله إلى طائفة منهم فاستأذنوك للخروج فقل لن تخرجوا معي أبدا ولن تقاتلوا معي عدوا إنكم رضيتم بالقعود أول مرة فاقعدوا مع الخالفين
en: If Allah brings you back to a party of them (the hypocrites), and they ask your permission to go out (to fight), say: "Never shall you go out with me nor fight an enemy with me; you were pleased to sit (inactive) on the first occasion, then you sit (now) with those who lag behind."

source: ولا تصل على أحد منهم مات أبدا ولا تقم على قبره إنهم كفروا بالله ورسوله وماتوا وهم فاسقون
en: And never (O Muhammad صلى الله عليه وسلم) pray (funeral prayer) for any of them (hypocrites) who dies, nor stand at his grave. Certainly they disbelieved in Allah and His Messenger, and died while they were Fasiqun (rebellious, - disobedient to Allah and His Messenger صلى الله عليه وسلم).

source: ولا تعجبك أموالهم وأولادهم إنما يريد الله أن يعذبهم بها في الدنيا وتزهق أنفسهم وهم كافرون
en: And let not their wealth or their children amaze you. Allah's Plan is to punish them with these things in this world, and that their souls shall depart (die) while they are disbelievers.

source: وإذا أنزلت سورة أن آمنوا بالله وجاهدوا مع رسوله استأذنك أولو الطول منهم وقالوا ذرنا نكن مع القاعدين
en: And when a Surah (chapter from the Qur'an) is revealed, enjoining them to believe in Allah and to strive hard and fight along with His Messenger, the wealthy among them ask your leave to exempt them (from Jihad) and say, "Leave us (behind), we would be with those who sit (at home)."

source: رضوا بأن يكونوا مع الخوالف وطبع على قلوبهم فهم لا يفقهون
en: They are content to be with those (the women) who sit behind (at home). Their hearts are sealed up (from all kinds of goodness and right guidance), so they understand not.

source: لكن الرسول والذين آمنوا معه جاهدوا بأموالهم وأنفسهم وأولئك لهم الخيرات وأولئك هم المفلحون
en: But the Messenger (Muhammad صلى الله عليه وسلم) and those who believed with him (in Islamic Monotheism) strove hard and fought with their wealth and their lives (in Allah's Cause). Such are they for whom are the good things, and it is they who will be successful.

source: أعد الله لهم جنات تجري من تحتها الأنهار خالدين فيها ذلك الفوز العظيم
en: For them Allah has got ready Gardens (Paradise) under which rivers flow, to dwell therein forever. That is the supreme success.

source: وجاء المعذرون من الأعراب ليؤذن لهم وقعد الذين كذبوا الله ورسوله سيصيب الذين كفروا منهم عذاب أليم
en: And those who made excuses from the bedouins came (to you, O Prophet صلى الله عليه وسلم) asking your permission to exempt them (from the battle), and those who had lied to Allah and His Messenger sat at home (without asking the permission for it); a painful torment will seize those of them who disbelieve.

source: ليس على الضعفاء ولا على المرضى ولا على الذين لا يجدون ما ينفقون حرج إذا نصحوا لله ورسوله ما على المحسنين من سبيل والله غفور رحيم
en: There is no blame on those who are weak or ill or who find no resources to spend [in holy fighting (Jihad)], if they are sincere and true (in duty) to Allah and His Messenger. No ground (of complaint) can there be against the Muhsinun (good-doers - See the footnote of V.9:120). And Allah is Oft-Forgiving, Most Merciful.

source: ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه تولوا وأعينهم تفيض من الدمع حزنا ألا يجدوا ما ينفقون
en: Nor (is there blame) on those who came to you to be provided with mounts, when you said: "I can find no mounts for you," they turned back, while their eyes overflowing with tears of grief that they could not find anything to spend (for Jihad).

source: إنما السبيل على الذين يستأذنونك وهم أغنياء رضوا بأن يكونوا مع الخوالف وطبع الله على قلوبهم فهم لا يعلمون
en: The ground (of complaint) is only against those who are rich, and yet ask exemption. They are content to be with (the women) who sit behind (at home) and Allah has sealed up their hearts (from all kinds of goodness and right guidance) so that they know not (what they are losing).

source: يعتذرون إليكم إذا رجعتم إليهم قل لا تعتذروا لن نؤمن لكم قد نبأنا الله من أخباركم وسيرى الله عملكم ورسوله ثم تردون إلى عالم الغيب والشهادة فينبئكم بما كنتم تعملون
en: They (the hypocrites) will present their excuses to you (Muslims), when you return to them. Say (O Muhammad صلى الله عليه وسلم) "Present no excuses, we shall not believe you. Allah has already informed us of the news concerning you. Allah and His Messenger will observe your deeds. In the end you will be brought back to the All-Knower of the unseen and the seen, then He (Allah) will inform you of what you used to do." [Tafsir At-Tabari]

source: سيحلفون بالله لكم إذا انقلبتم إليهم لتعرضوا عنهم فأعرضوا عنهم إنهم رجس ومأواهم جهنم جزاء بما كانوا يكسبون
en: They will swear by Allah to you (Muslims) when you return to them, that you may turn away from them. So turn away from them. Surely, they are Rijs [i.e. Najas (impure) because of their evil deeds], and Hell is their dwelling place - a recompense for that which they used to earn.

source: يحلفون لكم لترضوا عنهم فإن ترضوا عنهم فإن الله لا يرضى عن القوم الفاسقين
en: They (the hypocrites) swear to you (Muslims) that you may be pleased with them, but if you are pleased with them, certainly Allah is not pleased with the people who are Al-Fasiqun (rebellious, disobedient to Allah).

source: الأعراب أشد كفرا ونفاقا وأجدر ألا يعلموا حدود ما أنزل الله على رسوله والله عليم حكيم
en: The bedouins are the worst in disbelief and hypocrisy, and more likely to be in ignorance of the limits (Allah's Commandments and His Laws) which Allah has revealed to His Messenger. And Allah is All-Knower, All-Wise.

source: ومن الأعراب من يتخذ ما ينفق مغرما ويتربص بكم الدوائر عليهم دائرة السوء والله سميع عليم
en: And of the bedouins there are some who look upon what they spend (in Allah's Cause) as a fine and watch for calamities for you, on them be the calamity of evil. And Allah is All-Hearer, All-Knower.

source: ومن الأعراب من يؤمن بالله واليوم الآخر ويتخذ ما ينفق قربات عند الله وصلوات الرسول ألا إنها قربة لهم سيدخلهم الله في رحمته إن الله غفور رحيم
en: And of the bedouins there are some who believe in Allah and the Last Day, and look upon what they spend in Allah's Cause as means of nearness to Allah, and a cause of receiving the Messenger's invocations. Indeed these (spendings in Allah's Cause) are a means of nearness for them. Allah will admit them to His Mercy. Certainly Allah is Oft-Forgiving, Most Merciful.

source: والسابقون الأولون من المهاجرين والأنصار والذين اتبعوهم بإحسان رضي الله عنهم ورضوا عنه وأعد لهم جنات تجري تحتها الأنهار خالدين فيها أبدا ذلك الفوز العظيم
en: And the foremost to embrace Islam of the Muhajirun (those who migrated from Makkah to Al-Madinah) and the Ansar (the citizens of Al-Madinah who helped and gave aid to the Muhajirun ) and also those who followed them exactly (in Faith). Allah is well-pleased with them as they are well-pleased with Him. He has prepared for them Gardens under which rivers flow (Paradise), to dwell therein forever. That is the supreme success.

source: وممن حولكم من الأعراب منافقون ومن أهل المدينة مردوا على النفاق لا تعلمهم نحن نعلمهم سنعذبهم مرتين ثم يردون إلى عذاب عظيم
en: And among the bedouins around you, some are hypocrites, and so are some among the people of Al-Madinah who persist in hypocrisy; you (O Muhammad صلى الله عليه وسلم) know them not, We know them. We shall punish them twice, and thereafter they shall be brought back to a great (horrible) torment.

source: وآخرون اعترفوا بذنوبهم خلطوا عملا صالحا وآخر سيئا عسى الله أن يتوب عليهم إن الله غفور رحيم
en: And (there are) others who have acknowledged their sins, they have mixed a deed that was righteous with another that was evil. Perhaps Allah will turn unto them in forgiveness. Surely, Allah is Oft-Forgiving, Most Merciful.

source: خذ من أموالهم صدقة تطهرهم وتزكيهم بها وصل عليهم إن صلاتك سكن لهم والله سميع عليم
en: Take Sadaqah (alms) from their wealth in order to purify them and sanctify them with it, and invoke Allah for them. Verily! Your invocations are a source of security for them; and Allah is All-Hearer, All-Knower.

source: ألم يعلموا أن الله هو يقبل التوبة عن عباده ويأخذ الصدقات وأن الله هو التواب الرحيم
en: Know they not that Allah accepts repentance from His slaves and takes the Sadaqat (alms, charity), and that Allah Alone is the One Who forgives and accepts repentance, Most Merciful?

source: وقل اعملوا فسيرى الله عملكم ورسوله والمؤمنون وستردون إلى عالم الغيب والشهادة فينبئكم بما كنتم تعملون
en: And say (O Muhammad صلى الله عليه وسلم) "Do deeds! Allah will see your deeds, and (so will) His Messenger and the believers. And you will be brought back to the All-Knower of the unseen and the seen. Then He will inform you of what you used to do."

source: وآخرون مرجون لأمر الله إما يعذبهم وإما يتوب عليهم والله عليم حكيم
en: And others are made to await for Allah's Decree, whether He will punish them or will forgive them. And Allah is All-Knowing, All-Wise.

source: والذين اتخذوا مسجدا ضرارا وكفرا وتفريقا بين المؤمنين وإرصادا لمن حارب الله ورسوله من قبل وليحلفن إن أردنا إلا الحسنى والله يشهد إنهم لكاذبون
en: And as for those who put up a mosque by way of harm and disbelief and to disunite the believers and as an outpost for those who warred against Allah and His Messenger (Muhammad صلى الله عليه وسلم) aforetime, they will indeed swear that their intention is nothing but good. Allah bears witness that they are certainly liars.

source: لا تقم فيه أبدا لمسجد أسس على التقوى من أول يوم أحق أن تقوم فيه فيه رجال يحبون أن يتطهروا والله يحب المطهرين
en: Never stand you therein. Verily, the mosque whose foundation was laid from the first day on piety is more worthy that you stand therein (to pray). In it are men who love to clean and to purify themselves. And Allah loves those who make themselves clean and pure [i.e. who clean their private parts with dust (which has the properties of soap) and water from urine and stools, after answering the call of nature].

source: أفمن أسس بنيانه على تقوى من الله ورضوان خير أم من أسس بنيانه على شفا جرف هار فانهار به في نار جهنم والله لا يهدي القوم الظالمين
en: Is it then he who laid the foundation of his building on piety to Allah and His Good Pleasure better, or he who laid the foundation of his building on the brink of an undetermined precipice ready to crumble down, so that it crumbled to pieces with him into the Fire of Hell. And Allah guides not the people who are the Zalimun (cruel, violent, proud, polytheist and wrong-doer).

source: لا يزال بنيانهم الذي بنوا ريبة في قلوبهم إلا أن تقطع قلوبهم والله عليم حكيم
en: The building which they built will never cease to be a cause of hypocrisy and doubt in their hearts unless their hearts are cut to pieces. (i.e. till they die). And Allah is All-Knowing, All-Wise.

source: إن الله اشترى من المؤمنين أنفسهم وأموالهم بأن لهم الجنة يقاتلون في سبيل الله فيقتلون ويقتلون وعدا عليه حقا في التوراة والإنجيل والقرآن ومن أوفى بعهده من الله فاستبشروا ببيعكم الذي بايعتم به وذلك هو الفوز العظيم
en: Verily, Allah has purchased of the believers their lives and their properties for (the price) that theirs shall be the Paradise. They fight in Allah's Cause, so they kill (others) and are killed. It is a promise in truth which is binding on Him in the Taurat (Torah) and the Injeel (Gospel) and the Qur'an. And who is truer to his covenant than Allah? Then rejoice in the bargain which you have concluded. That is the supreme success.

source: التائبون العابدون الحامدون السائحون الراكعون الساجدون الآمرون بالمعروف والناهون عن المنكر والحافظون لحدود الله وبشر المؤمنين
en: (The believers whose lives Allah has purchased are) those who turn to Allah in repentance (from polytheism and hypocrisy, etc.), who worship (Him), who praise (Him), who fast (or go out in Allah's Cause), who bow down (in prayer), who prostrate themselves (in prayer), who enjoin (on people) Al-Ma'ruf (i.e. Islamic Monotheism and all what Islam has ordained) and forbid (people) from Al-Munkar (i.e. disbelief, polytheism of all kinds and all that Islam has forbidden), and who observe the limits set by Allah (do all that Allah has ordained and abstain from all kinds of sins and evil deeds which Allah has forbidden). And give glad tidings to the believers.

source: ما كان للنبي والذين آمنوا أن يستغفروا للمشركين ولو كانوا أولي قربى من بعد ما تبين لهم أنهم أصحاب الجحيم
en: It is not (proper) for the Prophet and those who believe to ask Allah's Forgiveness for the Mushrikun (polytheists, idolaters, pagans, disbelievers in the Oneness of Allah), even though they be of kin, after it has become clear to them that they are the dwellers of the Fire (because they died in a state of disbelief).

source: وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه فلما تبين له أنه عدو لله تبرأ منه إن إبراهيم لأواه حليم
en: And Ibrahim's (Abraham) invoking (of Allah) for his father's forgiveness was only because of a promise he [Ibrahim (Abraham)] had made to him (his father). But when it became clear to him [Ibrahim (Abraham)] that he (his father) is an enemy of Allah, he dissociated himself from him. Verily Ibrahim (Abraham) was Awwah (one who invokes Allah with humility, glorifies Him and remembers Him much) and was forbearing. (Tafsir Al-Qurtubi) .

source: وما كان الله ليضل قوما بعد إذ هداهم حتى يبين لهم ما يتقون إن الله بكل شيء عليم
en: And Allah will never lead a people astray after He has guided them until He makes clear to them as to what they should avoid. Verily, Allah is the All-Knower of everything.

source: إن الله له ملك السماوات والأرض يحيي ويميت وما لكم من دون الله من ولي ولا نصير
en: Verily, Allah! Unto Him belongs the dominion of the heavens and the earth, He gives life and He causes death. And besides Allah you have neither any Wali (protector or guardian) nor any helper.

source: لقد تاب الله على النبي والمهاجرين والأنصار الذين اتبعوه في ساعة العسرة من بعد ما كاد يزيغ قلوب فريق منهم ثم تاب عليهم إنه بهم رءوف رحيم
en: Allah has forgiven the Prophet (صلى الله عليه وسلم), the Muhajirun (Muslim emigrants who left their homes and came to Al-Madinah) and the Ansar (Muslims of Al-Madinah) who followed him (Muhammad صلى الله عليه وسلم) in the time of distress (Tabuk expedition), after the hearts of a party of them had nearly deviated (from the Right Path), but He accepted their repentance. Certainly, He is unto them full of Kindness, Most Merciful.

source: وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت وضاقت عليهم أنفسهم وظنوا أن لا ملجأ من الله إلا إليه ثم تاب عليهم ليتوبوا إن الله هو التواب الرحيم
en: And (He did forgive also) the three [who did not join the Tabuk expedition whose case was deferred (by the Prophet صلى الله عليه وسلم)] (for Allah's Decision) till for them the earth, vast as it is, was straitened and their ownselves were straitened to them, and they perceived that there is no fleeing from Allah, and no refuge but with Him. Then, He forgave them (accepted their repentance), that they might beg for His pardon [repent (unto Him)] Verily, Allah is the One Who forgives and accepts repentance, Most Merciful.

source: يا أيها الذين آمنوا اتقوا الله وكونوا مع الصادقين
en: O you who believe! Be afraid of Allah, and be with those who are true (in words and deeds).

source: ما كان لأهل المدينة ومن حولهم من الأعراب أن يتخلفوا عن رسول الله ولا يرغبوا بأنفسهم عن نفسه ذلك بأنهم لا يصيبهم ظمأ ولا نصب ولا مخمصة في سبيل الله ولا يطئون موطئا يغيظ الكفار ولا ينالون من عدو نيلا إلا كتب لهم به عمل صالح إن الله لا يضيع أجر المحسنين
en: It was not becoming of the people of Al-Madinah and the bedouins of the neighbourhood to remain behind Allah's Messenger (Muhammad صلى الله عليه وسلم when fighting in Allah's Cause) and (it was not becoming of them) to prefer their own lives to his life. That is because they suffer neither thirst nor fatigue, nor hunger in the Cause of Allah, nor they take any step to raise the anger of disbelievers nor inflict any injury upon an enemy but is written to their credit as a deed of righteousness. Surely, Allah wastes not the reward of the Muhsinun

source: ولا ينفقون نفقة صغيرة ولا كبيرة ولا يقطعون واديا إلا كتب لهم ليجزيهم الله أحسن ما كانوا يعملون
en: Nor do they spend anything (in Allah's Cause) - small or great - nor cross a valley, but is written to their credit that Allah may recompense them with the best of what they used to do (i.e. Allah will reward their good deeds according to the reward of their best deeds which they did in the most perfect manner).

source: وما كان المؤمنون لينفروا كافة فلولا نفر من كل فرقة منهم طائفة ليتفقهوا في الدين ولينذروا قومهم إذا رجعوا إليهم لعلهم يحذرون
en: And it is not (proper) for the believers to go out to fight (Jihad ) all together. Of every troop of them, a party only should go forth, that they (who are left behind) may get instructions in (Islamic) religion, and that they may warn their people when they return to them, so that they may beware (of evil).

source: يا أيها الذين آمنوا قاتلوا الذين يلونكم من الكفار وليجدوا فيكم غلظة واعلموا أن الله مع المتقين
en: O you who believe! Fight those of the disbelievers who are close to you, and let them find harshness in you; and know that Allah is with those who are Al-Muttaqun (the pious - See V.2:2).

source: وإذا ما أنزلت سورة فمنهم من يقول أيكم زادته هذه إيمانا فأما الذين آمنوا فزادتهم إيمانا وهم يستبشرون
en: And whenever there comes down a Surah (chapter from the Qur'an), some of them (hypocrites) say: "Which of you has had his Faith increased by it?" As for those who believe, it has increased their Faith, and they rejoice.

source: وأما الذين في قلوبهم مرض فزادتهم رجسا إلى رجسهم وماتوا وهم كافرون
en: But as for those in whose hearts is a disease (of doubt, disbelief and hypocrisy), it will add suspicion and doubt to their suspicion, disbelief and doubt; and they die while they are disbelievers.

source: أولا يرون أنهم يفتنون في كل عام مرة أو مرتين ثم لا يتوبون ولا هم يذكرون
en: See they not that they are put in trial once or twice every year (with different kinds of calamities, disease, famine)? Yet, they turn not in repentance, nor do they learn a lesson (from it).

source: وإذا ما أنزلت سورة نظر بعضهم إلى بعض هل يراكم من أحد ثم انصرفوا صرف الله قلوبهم بأنهم قوم لا يفقهون
en: And whenever there comes down a Surah (chapter from the Qur'an), they look at one another (saying): "Does any one see you?" Then they turn away. Allah has turned their hearts (from the light) because they are a people that understand not.

source: لقد جاءكم رسول من أنفسكم عزيز عليه ما عنتم حريص عليكم بالمؤمنين رءوف رحيم
en: Verily, there has come unto you a Messenger (Muhammad صلى الله عليه وسلم) from amongst yourselves (i.e. whom you know well). It grieves him that you should receive any injury or difficulty. He (Muhammad صلى الله عليه وسلم) is anxious over you (to be rightly guided, to repent to Allah, and beg Him to pardon and forgive your sins in order that you may enter Paradise and be saved from the punishment of the Hell-fire); for the believers (he صلى الله عليه وسلم is) full of pity, kind, and merciful.

source: فإن تولوا فقل حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم
en: But if they turn away, say (O Muhammad صلى الله عليه وسلم): "Allah is sufficient for me. La ilaha illa Huwa (none has the right to be worshipped but He) in Him I put my trust and He is the Lord of the Mighty Throne."

source: الر تلك آيات الكتاب الحكيم
en: Alif-Lam-Ra. [These letters are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings]. These are the Verses of the Book (the Qur'an) Al-Hakim

source: أكان للناس عجبا أن أوحينا إلى رجل منهم أن أنذر الناس وبشر الذين آمنوا أن لهم قدم صدق عند ربهم قال الكافرون إن هذا لساحر مبين
en: Is it a wonder for mankind that We have sent Our Revelation to a man from among themselves (i.e. Prophet Muhammad صلى الله عليه وسلم) (saying): "Warn mankind (of the coming torment in Hell), and give good news to those who believe (in the Oneness of Allah and in His Prophet Muhammad صلى الله عليه وسلم) that they shall have with their Lord the rewards of their good deeds?" (But) the disbelievers say: "This is indeed an evident sorcerer (i.e. Prophet Muhammad صلى الله عليه وسلم and the Qur'an)!
